

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПолучитьДанныеИнтерактивно(Команда)
	
	Результат = ПолучитьДанныеНаСервере(Истина);
	
	ТекстовыйДокумент = Новый ТекстовыйДокумент;
	ТекстовыйДокумент.УстановитьТекст(Результат);
	ТекстовыйДокумент.Показать();
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПолучитьДанныеНаСервере(ФормироватьСтрокой = Ложь)
	
	 Возврат ОбщийМодульСервер_СonFilter.ПреобразоватьВариантОтчета(ВариантОтчета, ФормироватьСтрокой, ОтладочныйРежим);
	
КонецФункции

&НаКлиенте
Процедура ПолучитьДанныеФайл(Команда)
	
	Результат = ПолучитьДанныеНаСервере();
	
	ТекстовыйДокумент = Новый ТекстовыйДокумент;
	ТекстовыйДокумент.УстановитьТекст(Результат);
	ТекстовыйДокумент.Показать();

КонецПроцедуры

#КонецОбласти

