
Функция АдресПубликацииИнформационнойБазыВИнтернете() Экспорт
	Результат = ОбщегоНазначения.АдресПубликацииИнформационнойБазыВИнтернете();
	Если ЗначениеЗаполнено(Результат)Тогда
		Результат = Результат+"#";
	Иначе
		Результат = "";
	КонецЕсли;
	Возврат Результат;	
КонецФункции

Функция Версия() Экспорт
	Для Каждого Расширение ИЗ РасширенияКонфигурации.Получить(Новый Структура("Имя", "СonFilter")) Цикл
		Возврат Расширение.Версия; 	
	КонецЦикла;
КонецФункции	

Функция ТипСсылкиВИД() Экспорт
	Результат  = Новый ОписаниеТипов();    
	Для Каждого ВнешнийИстоник ИЗ ВнешниеИсточникиДанных Цикл
		Результат = Новый ОписаниеТипов(Результат,ВнешнийИстоник.Таблицы.ТипВсеСсылки().Типы());		
	КонецЦикла;
	Возврат Результат;
КонецФункции			